In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [3]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [4]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [5]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns = ['one', 'two', 'three', 'four'])

In [6]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [7]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [8]:
data.drop('two', axis=1) # Specify with axis =1  ( columnwise selection)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [9]:
data.drop(['two', 'four'], axis = 1) #group of index, columns : with list.

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [10]:
obj = Series(np.arange(4. ), index = ['a', 'b', 'c', 'd'])

obj['b']

1.0

In [11]:
#Indexing, Selection, Filtering

obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b'], obj[1]

(1.0, 1.0)

In [12]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [13]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [14]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [15]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [16]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

In [17]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [18]:
obj[1:2]

b    1.0
dtype: float64

In [19]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [20]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [21]:
data = DataFrame(np.arange(16).reshape((4,4)), 
                index = ['Ohio', 'Colorado', 'Utah', 'New York'], 
                columns = ['one', 'two', 'three', 'four'])

In [22]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [23]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [24]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [25]:
#Exceptional Cases. Selecting rows by slicing #:# , boolean array -> regarded as selecting rows
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [26]:
data[data['three'] > 5 ]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [27]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [28]:
data[data<5] = 0

In [29]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [30]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [31]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [32]:
data.ix[ ['Colorado', 'Utah'], [3,0,1] ]

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [33]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [34]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [35]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [36]:
data.ix[data.three >5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [37]:
data.ix[2] #select row

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [38]:
#selection by  slicing : maintain dataframe.
type(data[2:3])
#selection by ix(loc,iloc) : drop dataframe if possible(Series)
type(data.ix[2])

pandas.core.series.Series

In [39]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [40]:
#Arithmetic and Data Alignment
s1 = Series( np.random.uniform(-10,10,20), index = map(chr,np.random.randint(65, 91, 20)) )
s1

D   -5.655379
K    7.356504
D    1.080970
C   -4.326904
Y   -0.973200
I   -7.015864
Y    0.850304
S   -3.935407
E    9.010500
O   -7.048843
C   -1.569539
E   -1.078669
Q    5.921704
V    7.990522
G   -1.293626
I   -5.552635
T    3.458545
F    8.887819
W   -1.377784
I    0.619644
dtype: float64

In [41]:
s2 = Series(np.random.uniform(-10,10,20), index = map(chr, np.random.randint(65,91, 20)) )
s2

Q   -9.512381
P   -6.340219
P   -4.799234
J    8.321628
L   -2.991520
M    3.096584
U   -3.981457
E   -7.811401
M    8.938158
V    0.317978
X    5.869572
H   -8.583460
M    5.256346
F   -3.380801
N   -5.001621
H   -8.537993
X    4.341135
N   -8.546795
R    8.704093
T    2.836202
dtype: float64

In [42]:
s1 + s2

C         NaN
C         NaN
D         NaN
D         NaN
E    1.199098
E   -8.890071
F    5.507019
G         NaN
H         NaN
H         NaN
I         NaN
I         NaN
I         NaN
J         NaN
K         NaN
L         NaN
M         NaN
M         NaN
M         NaN
N         NaN
N         NaN
O         NaN
P         NaN
P         NaN
Q   -3.590677
R         NaN
S         NaN
T    6.294748
U         NaN
V    8.308500
W         NaN
X         NaN
X         NaN
Y         NaN
Y         NaN
dtype: float64

In [43]:
df1 = 

#help(np.random.uniform)
chr(48)
ord('A')

SyntaxError: invalid syntax (<ipython-input-43-0d6a6a0372bb>, line 1)

In [44]:
for i,j in enumerate(range(200)):
    print (i, chr(i)) # 65~90 65,91 / 97, 123

0  
1 
2 
3 
4 
5 
6 
7 
8 
9
10

11
12
13
14 
15 
16 
17 
18 
19 
20 
21 
22 
23 
24 
25 
26 
27 
28
29
30
31
32
33 !
34 "
35 #
36 $
37 %
38 &
39 '
40 (
41 )
42 *
43 +
44 ,
45 -
46 .
47 /
48 0
49 1
50 2
51 3
52 4
53 5
54 6
55 7
56 8
57 9
58 :
59 ;
60 <
61 =
62 >
63 ?
64 @
65 A
66 B
67 C
68 D
69 E
70 F
71 G
72 H
73 I
74 J
75 K
76 L
77 M
78 N
79 O
80 P
81 Q
82 R
83 S
84 T
85 U
86 V
87 W
88 X
89 Y
90 Z
91 [
92 \
93 ]
94 ^
95 _
96 `
97 a
98 b
99 c
100 d
101 e
102 f
103 g
104 h
105 i
106 j
107 k
108 l
109 m
110 n
111 o
112 p
113 q
114 r
115 s
116 t
117 u
118 v
119 w
120 x
121 y
122 z
123 {
124 |
125 }
126 ~
127 
128 
129 
130 
131 
132 
133
134 
135 
136 
137 
138 
139 
140 
141 
142 
143 
144 
145 
146 
147 
148 
149 
150 
151 
152 
153 
154 
155 
156 
157 
158 
159 
160
161 ¡
162 ¢
163 £
164 ¤
165 ¥
166 ¦
167 §
168 ¨
169 ©
170 ª
171 «
172 ¬
173 ­
174 ®
175 ¯
176 °
177 ±
178 ²
179 ³
180 ´
181 µ
182 ¶
183 ·
184 ¸
185 ¹
186 º
187 »
188 ¼
189 ½
190 ¾
191 ¿
192 À
193 Á
194 Â
195 Ã
196 Ä
197 Å
198 Æ
199 Ç

In [45]:
np.random.uniform(-10,10,5)

array([ 7.31039302,  9.66178505,  4.82433959, -3.16801109, -4.90795003])

In [46]:
list(map(chr,np.random.randint(65, 91, 5)))

['C', 'L', 'A', 'O', 'N']

In [47]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
               index = ['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [48]:
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [49]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [50]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))

df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))

In [51]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [52]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [53]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [54]:
df1.add(df2, fill_value= 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [55]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [56]:
df1.reindex(index = df2.index, columns=df2.columns, fill_value=0)

     a    b     c     d    e
0  0.0  1.0   2.0   3.0  0.0
1  4.0  5.0   6.0   7.0  0.0
2  8.0  9.0  10.0  11.0  0.0
3  0.0  0.0   0.0   0.0  0.0

In [57]:
arr = np.arange(12.).reshape((3,4))

In [58]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [59]:
arr[0]
arr-arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [71]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])

In [66]:
frame = frame.ix[0]

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [72]:
frame.ix[0]

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [75]:
series = frame.iloc[0]

In [77]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [78]:
series2 = Series(range(3), index = ['b','e', 'f'])
frame + series2 #rowwise broadcast column matching.

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [85]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [88]:
frame.sub(series3, axis = 0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [90]:
frame.sub(series3)

        Ohio  Oregon  Texas  Utah   b   d   e
Utah     NaN     NaN    NaN   NaN NaN NaN NaN
Ohio     NaN     NaN    NaN   NaN NaN NaN NaN
Texas    NaN     NaN    NaN   NaN NaN NaN NaN
Oregon   NaN     NaN    NaN   NaN NaN NaN NaN

In [91]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),index=['Utah','Ohio', 'Texas','Oregon'])

In [92]:
frame

               b         d         e
Utah   -2.281084  0.743651 -0.525233
Ohio   -0.198931 -0.055228 -0.892093
Texas   0.142503  0.524358  0.817699
Oregon -0.616386 -0.112673 -0.017442

In [93]:
np.abs(frame)

               b         d         e
Utah    2.281084  0.743651  0.525233
Ohio    0.198931  0.055228  0.892093
Texas   0.142503  0.524358  0.817699
Oregon  0.616386  0.112673  0.017442

In [100]:
f = lambda x: x.max() - x.min()
frame.apply(f) #ColumnWise apply, axis = 0
#return series with each row mapping one resultant value from f <- column

b    2.423587
d    0.856324
e    1.709792
dtype: float64

In [102]:
frame.apply(f, axis = 1) #RowWise apply, axis = 1

Utah      3.024735
Ohio      0.836865
Texas     0.675196
Oregon    0.598944
dtype: float64

In [96]:
def f(x):
    return Series([x.min(), x.max()], index = ['min', 'max'])

frame.apply(f)

            b         d         e
min -2.281084 -0.112673 -0.892093
max  0.142503  0.743651  0.817699

In [97]:
format = lambda x: '%.2f' % x

In [98]:
frame.applymap(format)

            b      d      e
Utah    -2.28   0.74  -0.53
Ohio    -0.20  -0.06  -0.89
Texas    0.14   0.52   0.82
Oregon  -0.62  -0.11  -0.02

In [107]:
f = lambda x: x.max() - x.min()
print (frame.apply(f))
print (frame.apply(f, axis = 1))

b    2.423587
d    0.856324
e    1.709792
dtype: float64
Utah      3.024735
Ohio      0.836865
Texas     0.675196
Oregon    0.598944
dtype: float64

In [105]:
format = lambda x: '%.2f' % x

In [106]:
#applymap confuct elementwise operation
frame.applymap(format)

            b      d      e
Utah    -2.28   0.74  -0.53
Ohio    -0.20  -0.06  -0.89
Texas    0.14   0.52   0.82
Oregon  -0.62  -0.11  -0.02

In [109]:
#map conduct elementwise operation on series
frame['e'].map(format)

Utah      -0.53
Ohio      -0.89
Texas      0.82
Oregon    -0.02
Name: e, dtype: object

In [110]:
#Sorting and Ranking

obj = Series(range(4), index = ['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [112]:
frame = DataFrame(np.arange(8).reshape((2,4)), index = ['three', 'one'], columns=['d', 'a', 'b', 'c'])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [113]:
print (frame.sort_index(axis = 0)) #columndirection by row-values

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [111]:
print (frame.sort_index(axis = 1)) #row direction by column-values(different data type)

       d  a  b  c
one    4  5  6  7
three  0  1  2  3
       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [114]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [117]:
obj = Series(np.random.randint(-10,10,5))
obj

0   -9
1   -3
2    8
3    9
4    0
dtype: int64

In [118]:
#order() method not supported anymore.?
obj.sort_values()

0   -9
1   -3
4    0
2    8
3    9
dtype: int64

In [119]:
#Missing Values come at last
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [121]:
frame = DataFrame({'b': [4, -7, -3,2], 'a': [0,1,0,1]})
frame

   a  b
0  0  4
1  1 -7
2  0 -3
3  1  2

In [123]:
frame.sort_index(by = 'b')

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
1  1 -7
2  0 -3
3  1  2
0  0  4

In [124]:
frame.sort_values(by = 'b')

   a  b
1  1 -7
2  0 -3
3  1  2
0  0  4

In [125]:
frame.sort_index(by = ['a', 'b'])

/home/june/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
0  0  4
1  1 -7
3  1  2

In [126]:
frame.sort_values(by =['a', 'b'])

   a  b
2  0 -3
0  0  4
1  1 -7
3  1  2

In [130]:
print (frame)
frame.sort_values(axis = 1, by = 2)

   a  b
0  0  4
1  1 -7
2  0 -3
3  1  2

   b  a
0  4  0
1 -7  1
2 -3  0
3  2  1

In [134]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
print (obj)
obj.rank()

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [132]:
obj.rank(method = 'first') # Give Priority to preceeding elements for same value

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [143]:
print (obj)
print (obj.rank(ascending = False, method = 'max'))
print (obj.rank(ascending = True, method = 'min'))

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64
0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64
0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [137]:
obj.rank(ascending = False, method = 'min')

0    1.0
1    7.0
2    1.0
3    3.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [141]:
obj.rank(ascending = False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [142]:
obj.rank(ascending = False, method = 'first')

0    1.0
1    7.0
2    2.0
3    3.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [146]:
frame = DataFrame({'b' : [4.3, 7, -3, 2], 'a': [0,1,0,1], 'c' : [-2, 5, 8, -2.5]})

frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [147]:
frame.rank(axis = 1) # Along the row direction

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [148]:
frame.rank(axis = 0) #Along column direction

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [150]:
obj = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [152]:
obj.index.is_unique

False

In [153]:
#Series selection
obj['a']

a    0
a    1
dtype: int64

In [154]:
obj['c']

4

In [155]:
df = DataFrame(np.random.randn(4,3), index = ['a', 'a', 'b', 'b'])
df

          0         1         2
a -0.779843  0.123772  1.782875
a -1.053892 -0.082344 -0.011382
b -0.864952  0.212976  1.914522
b -0.944240 -0.787697  0.998338

In [156]:
df.loc['b']

          0         1         2
b -0.864952  0.212976  1.914522
b -0.944240 -0.787697  0.998338

In [160]:
#Summarizing and Computing Descriptive Statistics

df = DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], 
               index =['a', 'b', 'c', 'd'], columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [161]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [162]:
df.sum(axis = 1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [163]:
df.mean(axis = 1, skipna = False) #return NAN if nan exist

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [165]:
df.mean(axis = 1) Nan is omitted at the count.

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [167]:
print (df)
df.idxmax() #columnwise indexnumber with maximum value

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

one    b
two    d
dtype: object

In [171]:
print (df.cumsum())
print (df.cumsum(axis = 1)) #RowWise direction

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8
    one   two
a  1.40   NaN
b  7.10  2.60
c   NaN   NaN
d  0.75 -0.55

In [180]:
df_summ = df.describe() #  columnwise
df_summ

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [175]:
df.T.describe()

         a         b    c         d
count  1.0  2.000000  0.0  2.000000
mean   1.4  1.300000  NaN -0.275000
std    NaN  8.202439  NaN  1.449569
min    1.4 -4.500000  NaN -1.300000
25%    1.4 -1.600000  NaN -0.787500
50%    1.4  1.300000  NaN -0.275000
75%    1.4  4.200000  NaN  0.237500
max    1.4  7.100000  NaN  0.750000

In [178]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [183]:
print (frame)
frame.count() # axis = 1

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

0    3
1    3
2    3
3    3
dtype: int64

In [184]:
frame.min()

a    0.0
b   -3.0
c   -2.5
dtype: float64

In [185]:
frame.max()

a    1.0
b    7.0
c    8.0
dtype: float64

In [189]:
frame.idxmin()

a    0
b    2
c    3
dtype: int64

In [188]:
frame.idxmax()

a    1
b    1
c    2
dtype: int64

In [190]:
frame.quantile()

a    0.50
b    3.15
c    1.50
Name: 0.5, dtype: float64

In [191]:
frame.sum()

a     2.0
b    10.3
c     8.5
dtype: float64

In [192]:
frame.mean()

a    0.500
b    2.575
c    2.125
dtype: float64

In [193]:
frame.median()

a    0.50
b    3.15
c    1.50
dtype: float64

In [ ]:
frame.mad() #mean absolute deviation from mean value

In [ ]:
frame.var() #2nd moment

In [197]:
frame.std() #

a    0.577350
b    4.241364
c    5.202163
dtype: float64

In [198]:
frame.skew() #3rd moment

a    0.000000
b   -0.713752
c    0.271916
dtype: float64

In [199]:
frame.kurt() # 4th moment

a   -6.000000
b    0.491835
c   -4.366571
dtype: float64

In [200]:
frame.cumsum()

     a     b     c
0  0.0   4.3  -2.0
1  1.0  11.3   3.0
2  1.0   8.3  11.0
3  2.0  10.3   8.5

In [205]:
print (frame.cummin())
print (frame.cummax())

     a    b    c
0  0.0  4.3 -2.0
1  0.0  4.3 -2.0
2  0.0 -3.0 -2.0
3  0.0 -3.0 -2.5
     a    b    c
0  0.0  4.3 -2.0
1  1.0  7.0  5.0
2  1.0  7.0  8.0
3  1.0  7.0  8.0

In [210]:
frame.cumprod()

     a      b      c
0  0.0    4.3   -2.0
1  0.0   30.1  -10.0
2  0.0  -90.3  -80.0
3  0.0 -180.6  200.0

In [211]:
frame.diff()

     a     b     c
0  NaN   NaN   NaN
1  1.0   2.7   7.0
2 -1.0 -10.0   3.0
3  1.0   5.0 -10.5

In [212]:
frame.pct_change() #change in percent

          a         b       c
0       NaN       NaN     NaN
1       inf  0.627907 -3.5000
2 -1.000000 -1.428571  0.6000
3       inf -1.666667 -1.3125

In [228]:
import pandas_datareader as web
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT','GOOG']:
    #Yahoo No longer support Finance API
    all_data[ticker] = web.get_data_google(ticker)

In [227]:
all_data

{'AAPL':               Open    High     Low   Close     Volume
 Date
 2010-01-04   30.49   30.64   30.34   30.57  123432050
 2010-01-05   30.66   30.80   30.46   30.63  150476004
 2010-01-06   30.63   30.75   30.11   30.14  138039594
 2010-01-07   30.25   30.29   29.86   30.08  119282324
 2010-01-08   30.04   30.29   29.87   30.28  111969081
 2010-01-11   30.40   30.43   29.78   30.02  115557365
 2010-01-12   29.88   29.97   29.49   29.67  148614774
 2010-01-13   29.70   30.13   29.16   30.09  151472335
 2010-01-14   30.02   30.07   29.86   29.92  108288411
 2010-01-15   30.13   30.23   29.41   29.42  148584065
 2010-01-19   29.76   30.74   29.61   30.72  182501620
 2010-01-20   30.70   30.79   29.93   30.25  153037892
 2010-01-21   30.30   30.47   29.60   29.72  152038565
 2010-01-22   29.54   29.64   28.17   28.25  220441872
 2010-01-25   28.93   29.24   28.60   29.01  266424802
 2010-01-26   29.42   30.53   28.94   29.42  466777486
 2010-01-27   29.55   30.08   28.50   29.70  430642030
 2010-01-28   29.28   29.36   28.39   28.47  293375376
 2010-01-29   28.73   28.89   27.18   27.44  311487785
 2010-02-01   27.48   28.00   27.33   27.82  187468421
 2010-02-02   27.99   28.05   27.63   27.98  174585313
 2010-02-03   27.88   28.60   27.77   28.46  153831769
 2010-02-04   28.10   28.34   27.37   27.44  189412762
 2010-02-05   27.52   28.00   27.26   27.92  212576350
 2010-02-08   27.96   28.27   27.71   27.73  119567119
 2010-02-09   28.06   28.21   27.82   28.03  158221028
 2010-02-10   27.98   28.09   27.75   27.87   92590218
 2010-02-11   27.84   28.54   27.72   28.38  137585903
 2010-02-12   28.30   28.81   27.93   28.63  163866906
 2010-02-16   28.85   29.10   28.79   29.06  135987761
 ...            ...     ...     ...     ...        ...
 2017-05-09  153.87  154.88  153.45  153.99   39130363
 2017-05-10  153.63  153.94  152.11  153.26   25805692
 2017-05-11  152.45  154.07  152.31  153.95   27255058
 2017-05-12  154.70  156.42  154.67  156.10   32527017
 2017-05-15  156.01  156.65  155.05  155.70   26009719
 2017-05-16  155.94  156.06  154.72  155.47   20048478
 2017-05-17  153.60  154.57  149.71  150.25   50767678
 2017-05-18  151.27  153.34  151.13  152.54   33568215
 2017-05-19  153.38  153.98  152.63  153.06   26960788
 2017-05-22  154.00  154.58  152.91  153.99   22966437
 2017-05-23  154.90  154.90  153.31  153.80   19918871
 2017-05-24  153.84  154.17  152.67  153.34   19219154
 2017-05-25  153.73  154.35  153.03  153.87   19235598
 2017-05-26  154.00  154.24  153.31  153.61   21927637
 2017-05-30  153.42  154.43  153.33  153.67   20126851
 2017-05-31  153.97  154.17  152.38  152.76   24451164
 2017-06-01  153.17  153.33  152.22  153.18   16404088
 2017-06-02  153.58  155.45  152.89  155.45   27770715
 2017-06-05  154.34  154.45  153.46  153.93   25331662
 2017-06-06  153.90  155.81  153.78  154.45   26624926
 2017-06-07  155.02  155.98  154.48  155.37   21069647
 2017-06-08  155.25  155.54  154.40  154.99   21250798
 2017-06-09  155.19  155.19  146.02  148.98   64882657
 2017-06-12  145.74  146.09  142.51  145.42   72307330
 2017-06-13  147.16  147.45  145.15  146.59   34165445
 2017-06-14  147.50  147.50  143.84  145.16   31531232
 2017-06-15  143.32  144.48  142.21  144.29   32165373
 2017-06-16  143.78  144.50  142.20  142.27   50361093
 2017-06-19  143.66  146.74  143.66  146.34   32541404
 2017-06-20  146.87  146.87  144.94  145.01   24900073

 [1878 rows x 5 columns],
 'GOOG':               Open    High     Low   Close     Volume
 Date
 2010-01-04  313.16  314.44  311.81  313.06        NaN
 2010-01-05  313.28  313.61  310.46  311.68        NaN
 2010-01-06  312.62  312.62  302.88  303.83        NaN
 2010-01-07  304.40  304.70  296.03  296.75        NaN
 2010-01-08  295.70  301.32  294.26  300.71        NaN
 2010-01-11  301.93  301.93  296.72  300.25        NaN
 2010-01-12  298.74  298.78  293.71  294.94        NaN
 2010-01-13  287.96  293.90  286.66  293.25        NaN
 2010-01-14  291.66  296.80  291.11  294.63        NaN
 2010-01-15  295.50  296.48  288.73  289.71        NaN
 2010-01-19  290.45  294.91  287.86  293.52        NaN
 2010-01-20  292.70  292.70  287.36  289.91        NaN
 2010-01-21  291.43  293.12  285.84  291.20        NaN
 2010-01-22  281.97  285.01  267.16  274.73        NaN
 2010-01-25  273.02  274.66  267.49  269.73        NaN
 2010-01-26  268.72  274.53  267.88  270.94        NaN
 2010-01-27  270.36  273.55  267.39  270.78        NaN
 2010-01-28  271.97  273.23  265.03  266.88        NaN
 2010-01-29  268.98  270.22  262.54  264.71        NaN
 2010-02-01  267.03  267.64  264.88  266.24        NaN
 2010-02-02  267.21  267.21  263.54  265.29        NaN
 2010-02-03  264.07  270.78  263.85  270.14        NaN
 2010-02-04  268.23  268.73  262.52  263.13        NaN
 2010-02-05  263.94  266.48  260.97  265.38        NaN
 2010-02-08  265.98  270.73  265.50  266.47        NaN
 2010-02-09  269.50  270.49  267.27  267.95        NaN
 2010-02-10  266.77  268.63  263.58  266.96        NaN
 2010-02-11  265.86  269.97  264.49  267.93        NaN
 2010-02-12  266.22  268.31  264.98  266.29        NaN
 2010-02-16  268.30  271.79  266.88  270.38        NaN
 ...            ...     ...     ...     ...        ...
 2017-05-09  936.95  937.50  929.53  932.17  1581809.0
 2017-05-10  931.98  932.00  925.16  928.78  1173925.0
 2017-05-11  925.32  932.53  923.03  930.60   835386.0
 2017-05-12  931.53  933.44  927.85  932.22  1050601.0
 2017-05-15  932.95  938.25  929.34  937.08  1108496.0
 2017-05-16  940.00  943.11  937.58  943.00   969479.0
 2017-05-17  935.67  939.33  918.14  919.62  2362072.0
 2017-05-18  921.00  933.17  918.75  930.24  1596897.0
 2017-05-19  931.47  937.76  931.00  934.01  1393024.0
 2017-05-22  935.00  941.88  935.00  941.86  1120385.0
 2017-05-23  947.92  951.47  942.58  948.82  1270817.0
 2017-05-24  952.98  955.09  949.50  954.96  1034199.0
 2017-05-25  957.33  972.63  955.47  969.54  1660474.0
 2017-05-26  969.70  974.98  965.03  971.47  1252010.0
 2017-05-30  970.31  976.20  969.49  975.88  1466654.0
 2017-05-31  975.02  979.27  960.18  964.86  2448067.0
 2017-06-01  968.95  971.50  960.01  966.95  1410458.0
 2017-06-02  969.46  975.88  966.00  975.60  1750955.0
 2017-06-05  976.55  986.91  975.10  983.68  1252106.0
 2017-06-06  983.16  988.25  975.14  976.57  1814624.0
 2017-06-07  979.65  984.15  975.77  981.08  1453874.0
 2017-06-08  982.35  984.57  977.20  983.41  1481916.0
 2017-06-09  984.50  984.50  935.63  949.83  3309389.0
 2017-06-12  939.56  949.36  915.23  942.90  3763529.0
 2017-06-13  951.91  959.98  944.09  953.40  2013337.0
 2017-06-14  959.92  961.15  942.25  950.76  1489715.0
 2017-06-15  933.97  943.34  924.44  942.31  2133050.0
 2017-06-16  940.00  942.04  931.60  939.78  3094711.0
 2017-06-19  949.96  959.99  949.05  957.37  1533336.0
 2017-06-20  957.52  961.62  950.01  950.63  1125990.0

 [1878 rows x 5 columns],
 'IBM':               Open    High     Low   Close    Volume
 Date
 2010-01-04  131.18  132.97  130.85  132.45   6155846
 2010-01-05  131.68  131.85  130.10  130.85   6842471
 2010-01-06  130.68  131.49  129.81  130.00   5605290
 2010-01-07  129.87  130.25  128.91  129.55   5840569
 2010-01-08  129.07  130.92  129.05  130.85   4197105
 2010-01-11  131.06  131.06  128.67  129.48   5731177
 2010-01-12  129.03  131.33  129.00  130.51   8083354
 2010-01-13  130.39  131.12  129.16  130.23   6458302
 2010-01-14  130.55  132.71  129.91  132.31   7114544
 2010-01-15  132.03  132.89  131.09  131.78   8502320
 2010-01-19  131.63  134.25  131.56  134.14  13916168
 2010-01-20  130.46  131.15  128.95  130.25  15201857
 2010-01-21  130.47  130.69  128.06  129.00   9608696
 2010-01-22  128.67  128.89  125.37  125.50  10089325
 2010-01-25  126.33  126.90  125.71  126.12   5738920
 2010-01-26  125.92  127.75  125.41  125.75   7136640
 2010-01-27  125.82  126.96  125.04  126.33   8719447
 2010-01-28  127.03  127.04  123.05  123.75   9622829
 2010-01-29  124.32  125.00  121.90  122.39  11572387
 2010-02-01  123.23  124.95  122.78  124.67   7249873
 2010-02-02  124.79  125.81  123.95  125.53   5900187
 2010-02-03  125.16  126.07  125.07  125.66   4177981
 2010-02-04  125.19  125.44  122.90  123.00   9129991
 2010-02-05  123.04  123.72  121.83  123.52   8618019
 2010-02-08  123.15  123.22  121.74  121.88   5719389
 2010-02-09  122.65  124.20  122.46  123.21   6044966
 2010-02-10  122.94  123.65  122.21  122.81   5219260
 2010-02-11  122.58  124.20  122.06  123.73   5091096
 2010-02-12  123.01  124.05  121.61  124.00   8018236
 2010-02-16  124.91  125.23  124.11  125.23   6777265
 ...            ...     ...     ...     ...       ...
 2017-05-09  152.60  153.10  151.56  152.11   6853043
 2017-05-10  151.65  152.37  151.13  151.25   4999861
 2017-05-11  151.05  151.15  149.79  150.65   5627964
 2017-05-12  150.30  151.26  150.00  150.37   3715702
 2017-05-15  150.62  151.83  150.45  151.51   4245471
 2017-05-16  151.66  153.99  151.66  153.68   5513690
 2017-05-17  153.30  154.14  150.89  150.93   5191494
 2017-05-18  150.86  151.33  150.11  150.78   3274371
 2017-05-19  151.01  152.46  150.89  151.98   5643264
 2017-05-22  152.10  152.84  151.60  152.64   3302539
 2017-05-23  152.57  153.68  151.92  152.03   2564503
 2017-05-24  152.21  152.76  151.23  152.51   3732399
 2017-05-25  153.25  153.73  152.95  153.20   2582815
 2017-05-26  152.85  153.00  152.06  152.49   2443507
 2017-05-30  151.95  152.67  151.59  151.73   3666032
 2017-05-31  152.03  152.80  151.65  152.63   3543404
 2017-06-01  152.80  152.87  151.63  152.67   2918126
 2017-06-02  153.07  153.20  151.80  152.05   3585701
 2017-06-05  151.82  152.93  151.68  152.41   3975268
 2017-06-06  152.00  152.89  152.00  152.37   3797173
 2017-06-07  153.05  154.20  150.80  150.98   4865712
 2017-06-08  151.00  152.82  150.92  152.10   3708962
 2017-06-09  152.00  154.26  151.88  154.10   4361460
 2017-06-12  154.19  157.20  154.02  155.18   6471479
 2017-06-13  155.44  155.48  154.15  154.25   3523529
 2017-06-14  153.97  154.94  152.94  153.81   3049726
 2017-06-15  153.29  154.69  153.29  154.22   4654297
 2017-06-16  154.23  155.42  152.97  155.38   6741963
 2017-06-19  155.51  155.86  154.54  154.84   4629592
 2017-06-20  154.48  155.39  154.25  154.95   4481843

 [1879 rows x 5 columns],
 'MSFT':              Open   High    Low  Close     Volume
 Date
 2010-01-04  30.62  31.10  30.59  30.95   38414185
 2010-01-05  30.85  31.10  30.64  30.96   49758862
 2010-01-06  30.88  31.08  30.52  30.77   58182332
 2010-01-07  30.63  30.70  30.19  30.45   50564285
 2010-01-08  30.28  30.88  30.24  30.66   51201289
 2010-01-11  30.71  30.76  30.12  30.27   68754648
 2010-01-12  30.15  30.40  29.91  30.07   65913228
 2010-01-13  30.26  30.52  30.01  30.35   51863463
 2010-01-14  30.31  31.10  30.26  30.96   63244767
 2010-01-15  31.08  31.24  30.71  30.86   79915648
 2010-01-19  30.75  31.24  30.68  31.10   46582886
 2010-01-20  30.81  30.94  30.31  30.58   54857712
 2010-01-21  30.61  30.72  30.00  30.01   73086701
 2010-01-22  30.00  30.20  28.84  28.96  102004573
 2010-01-25  29.24  29.66  29.10  29.32   63381173
 2010-01-26  29.20  29.85  29.09  29.50   66647676
 2010-01-27  29.35  29.82  29.02  29.67   63949492
 2010-01-28  29.84  29.87  28.89  29.16  117513692
 2010-01-29  29.90  29.92  27.66  28.18  193888424
 2010-02-01  28.39  28.48  27.92  28.41   85931099
 2010-02-02  28.37  28.50  28.14  28.46   54413654
 2010-02-03  28.26  28.79  28.12  28.63   61397848
 2010-02-04  28.38  28.50  27.81  27.84   77849968
 2010-02-05  28.00  28.28  27.57  28.02   80960063
 2010-02-08  28.01  28.08  27.57  27.72   52826474
 2010-02-09  27.97  28.34  27.75  28.01   59195742
 2010-02-10  28.03  28.24  27.84  27.99   48591246
 2010-02-11  27.93  28.40  27.70  28.12   65995913
 2010-02-12  27.81  28.06  27.58  27.93   81121515
 2010-02-16  28.13  28.37  28.02  28.35   51938098
 ...           ...    ...    ...    ...        ...
 2017-05-09  68.86  69.28  68.68  69.04   22858414
 2017-05-10  68.99  69.56  68.92  69.31   17977830
 2017-05-11  68.36  68.73  68.12  68.46   28789413
 2017-05-12  68.61  68.61  68.04  68.38   18714123
 2017-05-15  68.14  68.48  67.57  68.43   31530301
 2017-05-16  68.23  69.44  68.16  69.41   34956038
 2017-05-17  68.89  69.10  67.43  67.48   30548781
 2017-05-18  67.40  68.13  67.14  67.71   25201274
 2017-05-19  67.50  68.10  67.43  67.69   26961119
 2017-05-22  67.89  68.50  67.50  68.45   16237550
 2017-05-23  68.72  68.75  68.38  68.68   15425824
 2017-05-24  68.87  68.88  68.45  68.77   14666865
 2017-05-25  68.97  69.88  68.91  69.62   21854095
 2017-05-26  69.80  70.22  69.52  69.96   19827923
 2017-05-30  69.79  70.41  69.77  70.41   17072838
 2017-05-31  70.53  70.74  69.81  69.84   30436364
 2017-06-01  70.24  70.61  69.45  70.10   21603601
 2017-06-02  70.44  71.86  70.24  71.76   34770261
 2017-06-05  71.97  72.89  71.81  72.28   33316760
 2017-06-06  72.30  72.62  72.27  72.52   31511065
 2017-06-07  72.64  72.77  71.95  72.39   22301765
 2017-06-08  72.51  72.52  71.50  71.95   24588270
 2017-06-09  72.04  72.08  68.59  70.32   49187396
 2017-06-12  69.25  69.94  68.13  69.78   47761743
 2017-06-13  70.02  70.82  69.96  70.65   25258614
 2017-06-14  70.91  71.10  69.43  70.27   25510685
 2017-06-15  69.27  70.21  68.80  69.90   26068709
 2017-06-16  69.73  70.03  69.22  70.00   48345085
 2017-06-19  70.50  70.94  70.35  70.87   23798268
 2017-06-20  70.82  70.87  69.87  69.91   21512231

 [1878 rows x 5 columns]}

In [244]:
price = DataFrame({tic: data['Close'] for tic, data in all_data.items()})

In [246]:
volume = DataFrame({ tic: data['Volume'] for tic, data in all_data.items() })

In [255]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001963 -0.004408 -0.012080  0.000323
2010-01-06 -0.015997 -0.025186 -0.006496 -0.006137
2010-01-07 -0.001991 -0.023303 -0.003462 -0.010400
2010-01-08  0.006649  0.013345  0.010035  0.006897
2010-01-11 -0.008587 -0.001530 -0.010470 -0.012720
2010-01-12 -0.011659 -0.017685  0.007955 -0.006607
2010-01-13  0.014156 -0.005730 -0.002145  0.009312
2010-01-14 -0.005650  0.004706  0.015972  0.020099
2010-01-15 -0.016711 -0.016699 -0.004006 -0.003230
2010-01-19  0.044188  0.013151  0.017909  0.007777
2010-01-20 -0.015299 -0.012299 -0.029000 -0.016720
2010-01-21 -0.017521  0.004450 -0.009597 -0.018640
2010-01-22 -0.049462 -0.056559 -0.027132 -0.034988
2010-01-25  0.026903 -0.018200  0.004940  0.012431
2010-01-26  0.014133  0.004486 -0.002934  0.006139
2010-01-27  0.009517 -0.000591  0.004612  0.005763
2010-01-28 -0.041414 -0.014403 -0.020423 -0.017189
2010-01-29 -0.036178 -0.008131 -0.010990 -0.033608
2010-02-01  0.013848  0.005780  0.018629  0.008162
2010-02-02  0.005751 -0.003568  0.006898  0.001760
2010-02-03  0.017155  0.018282  0.001036  0.005973
2010-02-04 -0.035840 -0.025950 -0.021168 -0.027593
2010-02-05  0.017493  0.008551  0.004228  0.006466
2010-02-08 -0.006805  0.004107 -0.013277 -0.010707
2010-02-09  0.010819  0.005554  0.010912  0.010462
2010-02-10 -0.005708 -0.003695 -0.003246 -0.000714
2010-02-11  0.018299  0.003634  0.007491  0.004645
2010-02-12  0.008809 -0.006121  0.002182 -0.006757
2010-02-16  0.015019  0.015359  0.009919  0.015038
...              ...       ...       ...       ...
2017-05-09  0.006405 -0.002280 -0.006012  0.001451
2017-05-10 -0.004741 -0.003637 -0.005654  0.003911
2017-05-11  0.004502  0.001960 -0.003967 -0.012264
2017-05-12  0.013966  0.001741 -0.001859 -0.001169
2017-05-15 -0.002562  0.005213  0.007581  0.000731
2017-05-16 -0.001477  0.006317  0.014322  0.014321
2017-05-17 -0.033576 -0.024793 -0.017894 -0.027806
2017-05-18  0.015241  0.011548 -0.000994  0.003408
2017-05-19  0.003409  0.004053  0.007959 -0.000295
2017-05-22  0.006076  0.008405  0.004343  0.011228
2017-05-23 -0.001234  0.007390 -0.003996  0.003360
2017-05-24 -0.002991  0.006471  0.003157  0.001310
2017-05-25  0.003456  0.015268  0.004524  0.012360
2017-05-26 -0.001690  0.001991 -0.004634  0.004884
2017-05-30  0.000391  0.004540 -0.004984  0.006432
2017-05-31 -0.005922 -0.011292  0.005932 -0.008095
2017-06-01  0.002749  0.002166  0.000262  0.003723
2017-06-02  0.014819  0.008946 -0.004061  0.023680
2017-06-05 -0.009778  0.008282  0.002368  0.007246
2017-06-06  0.003378 -0.007228 -0.000262  0.003320
2017-06-07  0.005957  0.004618 -0.009123 -0.001793
2017-06-08 -0.002446  0.002375  0.007418 -0.006078
2017-06-09 -0.038777 -0.034146  0.013149 -0.022655
2017-06-12 -0.023896 -0.007296  0.007008 -0.007679
2017-06-13  0.008046  0.011136 -0.005993  0.012468
2017-06-14 -0.009755 -0.002769 -0.002853 -0.005379
2017-06-15 -0.005993 -0.008888  0.002666 -0.005265
2017-06-16 -0.014000 -0.002685  0.007522  0.001431
2017-06-19  0.028608  0.018717 -0.003475  0.012429
2017-06-20 -0.009088 -0.007040  0.000710 -0.013546

[1879 rows x 4 columns]

In [275]:
returns.mul(100).applymap( (lambda x : '%4.2f' % x) )

             AAPL   GOOG    IBM   MSFT
Date
2010-01-04    nan    nan    nan    nan
2010-01-05   0.20  -0.44  -1.21   0.03
2010-01-06  -1.60  -2.52  -0.65  -0.61
2010-01-07  -0.20  -2.33  -0.35  -1.04
2010-01-08   0.66   1.33   1.00   0.69
2010-01-11  -0.86  -0.15  -1.05  -1.27
2010-01-12  -1.17  -1.77   0.80  -0.66
2010-01-13   1.42  -0.57  -0.21   0.93
2010-01-14  -0.56   0.47   1.60   2.01
2010-01-15  -1.67  -1.67  -0.40  -0.32
2010-01-19   4.42   1.32   1.79   0.78
2010-01-20  -1.53  -1.23  -2.90  -1.67
2010-01-21  -1.75   0.44  -0.96  -1.86
2010-01-22  -4.95  -5.66  -2.71  -3.50
2010-01-25   2.69  -1.82   0.49   1.24
2010-01-26   1.41   0.45  -0.29   0.61
2010-01-27   0.95  -0.06   0.46   0.58
2010-01-28  -4.14  -1.44  -2.04  -1.72
2010-01-29  -3.62  -0.81  -1.10  -3.36
2010-02-01   1.38   0.58   1.86   0.82
2010-02-02   0.58  -0.36   0.69   0.18
2010-02-03   1.72   1.83   0.10   0.60
2010-02-04  -3.58  -2.59  -2.12  -2.76
2010-02-05   1.75   0.86   0.42   0.65
2010-02-08  -0.68   0.41  -1.33  -1.07
2010-02-09   1.08   0.56   1.09   1.05
2010-02-10  -0.57  -0.37  -0.32  -0.07
2010-02-11   1.83   0.36   0.75   0.46
2010-02-12   0.88  -0.61   0.22  -0.68
2010-02-16   1.50   1.54   0.99   1.50
...           ...    ...    ...    ...
2017-05-09   0.64  -0.23  -0.60   0.15
2017-05-10  -0.47  -0.36  -0.57   0.39
2017-05-11   0.45   0.20  -0.40  -1.23
2017-05-12   1.40   0.17  -0.19  -0.12
2017-05-15  -0.26   0.52   0.76   0.07
2017-05-16  -0.15   0.63   1.43   1.43
2017-05-17  -3.36  -2.48  -1.79  -2.78
2017-05-18   1.52   1.15  -0.10   0.34
2017-05-19   0.34   0.41   0.80  -0.03
2017-05-22   0.61   0.84   0.43   1.12
2017-05-23  -0.12   0.74  -0.40   0.34
2017-05-24  -0.30   0.65   0.32   0.13
2017-05-25   0.35   1.53   0.45   1.24
2017-05-26  -0.17   0.20  -0.46   0.49
2017-05-30   0.04   0.45  -0.50   0.64
2017-05-31  -0.59  -1.13   0.59  -0.81
2017-06-01   0.27   0.22   0.03   0.37
2017-06-02   1.48   0.89  -0.41   2.37
2017-06-05  -0.98   0.83   0.24   0.72
2017-06-06   0.34  -0.72  -0.03   0.33
2017-06-07   0.60   0.46  -0.91  -0.18
2017-06-08  -0.24   0.24   0.74  -0.61
2017-06-09  -3.88  -3.41   1.31  -2.27
2017-06-12  -2.39  -0.73   0.70  -0.77
2017-06-13   0.80   1.11  -0.60   1.25
2017-06-14  -0.98  -0.28  -0.29  -0.54
2017-06-15  -0.60  -0.89   0.27  -0.53
2017-06-16  -1.40  -0.27   0.75   0.14
2017-06-19   2.86   1.87  -0.35   1.24
2017-06-20  -0.91  -0.70   0.07  -1.35

[1879 rows x 4 columns]

In [278]:
returns.MSFT.corr(returns.IBM)

0.48825135960101312

In [279]:
Series([-1,1,-1,1]).corr(Series([-1,1,-1,1]))

1.0

In [283]:
Series([-1,1,-1,1]).corr(Series([-1,0,-1,1]))

0.90453403373329089

In [284]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.412591  0.372964  0.389350
GOOG  0.412591  1.000000  0.395639  0.472876
IBM   0.372964  0.395639  1.000000  0.488251
MSFT  0.389350  0.472876  0.488251  1.000000

In [288]:
returns.var()

AAPL    0.000263
GOOG    0.000238
IBM     0.000142
MSFT    0.000204
dtype: float64

In [285]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000263  0.000103  0.000072  0.000090
GOOG  0.000103  0.000238  0.000073  0.000104
IBM   0.000072  0.000073  0.000142  0.000083
MSFT  0.000090  0.000104  0.000083  0.000204

In [291]:
returns.corrwith(returns.IBM) #correlation with IBM

AAPL    0.372964
GOOG    0.395639
IBM     1.000000
MSFT    0.488251
dtype: float64

In [292]:
returns.corrwith(volume) #correlaton between returns and volume.

AAPL   -0.071457
GOOG    0.037108
IBM    -0.207807
MSFT   -0.090617
dtype: float64

In [293]:
volume

                   AAPL       GOOG       IBM         MSFT
Date
2010-01-04  123432050.0        NaN   6155846   38414185.0
2010-01-05  150476004.0        NaN   6842471   49758862.0
2010-01-06  138039594.0        NaN   5605290   58182332.0
2010-01-07  119282324.0        NaN   5840569   50564285.0
2010-01-08  111969081.0        NaN   4197105   51201289.0
2010-01-11  115557365.0        NaN   5731177   68754648.0
2010-01-12  148614774.0        NaN   8083354   65913228.0
2010-01-13  151472335.0        NaN   6458302   51863463.0
2010-01-14  108288411.0        NaN   7114544   63244767.0
2010-01-15  148584065.0        NaN   8502320   79915648.0
2010-01-19  182501620.0        NaN  13916168   46582886.0
2010-01-20  153037892.0        NaN  15201857   54857712.0
2010-01-21  152038565.0        NaN   9608696   73086701.0
2010-01-22  220441872.0        NaN  10089325  102004573.0
2010-01-25  266424802.0        NaN   5738920   63381173.0
2010-01-26  466777486.0        NaN   7136640   66647676.0
2010-01-27  430642030.0        NaN   8719447   63949492.0
2010-01-28  293375376.0        NaN   9622829  117513692.0
2010-01-29  311487785.0        NaN  11572387  193888424.0
2010-02-01  187468421.0        NaN   7249873   85931099.0
2010-02-02  174585313.0        NaN   5900187   54413654.0
2010-02-03  153831769.0        NaN   4177981   61397848.0
2010-02-04  189412762.0        NaN   9129991   77849968.0
2010-02-05  212576350.0        NaN   8618019   80960063.0
2010-02-08  119567119.0        NaN   5719389   52826474.0
2010-02-09  158221028.0        NaN   6044966   59195742.0
2010-02-10   92590218.0        NaN   5219260   48591246.0
2010-02-11  137585903.0        NaN   5091096   65995913.0
2010-02-12  163866906.0        NaN   8018236   81121515.0
2010-02-16  135987761.0        NaN   6777265   51938098.0
...                 ...        ...       ...          ...
2017-05-09   39130363.0  1581809.0   6853043   22858414.0
2017-05-10   25805692.0  1173925.0   4999861   17977830.0
2017-05-11   27255058.0   835386.0   5627964   28789413.0
2017-05-12   32527017.0  1050601.0   3715702   18714123.0
2017-05-15   26009719.0  1108496.0   4245471   31530301.0
2017-05-16   20048478.0   969479.0   5513690   34956038.0
2017-05-17   50767678.0  2362072.0   5191494   30548781.0
2017-05-18   33568215.0  1596897.0   3274371   25201274.0
2017-05-19   26960788.0  1393024.0   5643264   26961119.0
2017-05-22   22966437.0  1120385.0   3302539   16237550.0
2017-05-23   19918871.0  1270817.0   2564503   15425824.0
2017-05-24   19219154.0  1034199.0   3732399   14666865.0
2017-05-25   19235598.0  1660474.0   2582815   21854095.0
2017-05-26   21927637.0  1252010.0   2443507   19827923.0
2017-05-30   20126851.0  1466654.0   3666032   17072838.0
2017-05-31   24451164.0  2448067.0   3543404   30436364.0
2017-06-01   16404088.0  1410458.0   2918126   21603601.0
2017-06-02   27770715.0  1750955.0   3585701   34770261.0
2017-06-05   25331662.0  1252106.0   3975268   33316760.0
2017-06-06   26624926.0  1814624.0   3797173   31511065.0
2017-06-07   21069647.0  1453874.0   4865712   22301765.0
2017-06-08   21250798.0  1481916.0   3708962   24588270.0
2017-06-09   64882657.0  3309389.0   4361460   49187396.0
2017-06-12   72307330.0  3763529.0   6471479   47761743.0
2017-06-13   34165445.0  2013337.0   3523529   25258614.0
2017-06-14   31531232.0  1489715.0   3049726   25510685.0
2017-06-15   32165373.0  2133050.0   4654297   26068709.0
2017-06-16   50361093.0  3094711.0   6741963   48345085.0
2017-06-19   32541404.0  1533336.0   4629592   23798268.0
2017-06-20   24900073.0  1125990.0   4481843   21512231.0

[1879 rows x 4 columns]